/*
Напишите программу, которая на вход принимает число и выдаёт его квадрат
*/

Console.WriteLine("Введи число: ");
int number = Convert.ToInt32(Console.ReadLine());
int result = number * number;
Console.WriteLine(result);